---
type: DWGExportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# DWGExportOptions

`Autodesk.Revit.DB.DWGExportOptions` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DWGExportOptions | — | `` |
| Constructor | DWGExportOptions | — | `public DWGExportOptions ()` |
| Method | GetPredefinedOptions | — | `public static DWGExportOptions GetPredefinedOptions ( Document document , string setup )` |
| Property | MergedViews | — | `public bool MergedViews { get ; set ; }` |